app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES('rajib', '2010-06-27 04:42:24', '2010-06-27 04:42:24')